xXxMrDEDOxXx/FRA271-LAB2-B10-56-68-74-78/DC motor simulink/waijung_18.11a/targets/stm32f4_target/stm32f4/utils/STM32F4xx_DSP_StdPeriph_Lib/Libraries/STM32F4x7_ETH_Driver/src/stm32f4x7_eth__.c
	  /* Set CR bits depending on hclk value */
	  if((hclk >= 20000000)&&(hclk < 35000000))
	  {
		/* CSR Clock Range between 20-35 MHz */
		tmpreg |= (uint32_t)ETH_MACMIIAR_CR_Div16;
	  }
	  else if((hclk >= 35000000)&&(hclk < 60000000))
	  {
		/* CSR Clock Range between 35-60 MHz */ 
		tmpreg |= (uint32_t)ETH_MACMIIAR_CR_Div26;    
	  }  
	  else if((hclk >= 60000000)&&(hclk < 100000000))
	  {
		/* CSR Clock Range between 60-100 MHz */ 
		tmpreg |= (uint32_t)ETH_MACMIIAR_CR_Div42;    
	  }  
	  else if((hclk >= 100000000)&&(hclk < 150000000))
	  {
		/* CSR Clock Range between 100-150 MHz */ 
		tmpreg |= (uint32_t)ETH_MACMIIAR_CR_Div62;    
	  }   
	  else /* ((hclk >= 150000000)&&(hclk <= 168000000)) */
	  {
		/* CSR Clock Range between 150-168 MHz */ 
		tmpreg |= (uint32_t)ETH_MACMIIAR_CR_Div102;    
	  }
  
	  /* Write to ETHERNET MAC MIIAR: Configure the ETHERNET CSR Clock Range */
	  ETH->MACMIIAR = (uint32_t)tmpreg; 

	  /*-------------------- PHY initialization and configuration ----------------*/
	  /* Put the PHY in reset mode */
	  if(!(ETH_WritePHYRegister(PHYAddress, PHY_BCR, PHY_Reset)))
	  {
		/* Return ERROR in case of write timeout */
		return ETH_ERROR;
	  }
  
	  /* Delay to assure PHY reset */
	  _eth_delay_(PHY_RESET_DELAY);

  	  /* --- Next --- */
	  *nonblocking_state = 1;
	  non_blocking_substate = 0;
	  //timeout = 0;

  } /* *nonblocking_state == 0 */
 
  if(*nonblocking_state == 1) {

	  if(ETH_InitStruct->ETH_AutoNegotiation != ETH_AutoNegotiation_Disable)
	  {  
			switch(non_blocking_substate) {
			/* We wait for linked status... */
			case 0:
				//do
				//{
				//  timeout++;
				//} while (!(ETH_ReadPHYRegister(PHYAddress, PHY_BSR) & PHY_Linked_Status) && (timeout < PHY_READ_TO));

				if(!(ETH_ReadPHYRegister(PHYAddress, PHY_BSR) & PHY_Linked_Status)) {
					return ETH_PENDING;
				}

				/* Return ERROR in case of timeout */
				//if(timeout == PHY_READ_TO)
				//{
				//	return ETH_ERROR;
				//}

				/* Enable Auto-Negotiation */
				if(!(ETH_WritePHYRegister(PHYAddress, PHY_BCR, PHY_AutoNegotiation)))
				{
				  /* Return ERROR in case of write timeout */
				  return ETH_ERROR;
				}

				/* Reset Timeout counter */
				//timeout = 0; 

				/* Next sub-state */
				non_blocking_substate++;

				break;

			/*Wait until the auto-negotiation will be completed */
			case 1:
				//do
				//{
				//  timeout++;
				//} while (!(ETH_ReadPHYRegister(PHYAddress, PHY_BSR) & PHY_AutoNego_Complete) && (timeout < (uint32_t)PHY_READ_TO));  

				if(!(ETH_ReadPHYRegister(PHYAddress, PHY_BSR) & PHY_AutoNego_Complete)) {
					return ETH_PENDING;
				}

				/* Return ERROR in case of timeout */
				//if(timeout == PHY_READ_TO)
				//{
				//  return ETH_ERROR;
				//}

				/* Reset Timeout counter */
				//timeout = 0;

				/* Read the result of the auto-negotiation */
				RegValue = ETH_ReadPHYRegister(PHYAddress, PHY_SR);
  
				/* Configure the MAC with the Duplex Mode fixed by the auto-negotiation process */
				if((RegValue & PHY_DUPLEX_STATUS) != (uint32_t)RESET)
				{
				  /* Set Ethernet duplex mode to Full-duplex following the auto-negotiation */
				  ETH_InitStruct->ETH_Mode = ETH_Mode_FullDuplex;  
				}
				else
				{
				  /* Set Ethernet duplex mode to Half-duplex following the auto-negotiation */
				  ETH_InitStruct->ETH_Mode = ETH_Mode_HalfDuplex;           
				}

				/* Configure the MAC with the speed fixed by the auto-negotiation process */
				if(RegValue & PHY_SPEED_STATUS)
				{  
				  /* Set Ethernet speed to 10M following the auto-negotiation */    
				  ETH_InitStruct->ETH_Speed = ETH_Speed_10M; 
				}
				else
				{   
				  /* Set Ethernet speed to 100M following the auto-negotiation */ 
				  ETH_InitStruct->ETH_Speed = ETH_Speed_100M;      
				}    

				/* Next sub-state */
				non_blocking_substate++;

  				/* Next */
				*nonblocking_state = 2;
		  }
	  }
	  else
	  {
		if(!ETH_WritePHYRegister(PHYAddress, PHY_BCR, ((uint16_t)(ETH_InitStruct->ETH_Mode >> 3) |
													   (uint16_t)(ETH_InitStruct->ETH_Speed >> 1))))
		{
		  /* Return ERROR in case of write timeout */
		  return ETH_ERROR;
		}
		/* Delay to assure PHY configuration */
		_eth_delay_(PHY_CONFIG_DELAY);

 
	    /* Next */
	    *nonblocking_state = 2;
    
	  }

  }
  
  if(*nonblocking_state == 2) {

	  /*------------------------ ETHERNET MACCR Configuration --------------------*/
	  /* Get the ETHERNET MACCR value */  
	  tmpreg = ETH->MACCR;
	  /* Clear WD, PCE, PS, TE and RE bits */
	  tmpreg &= MACCR_CLEAR_MASK;
	  /* Set the WD bit according to ETH_Watchdog value */
	  /* Set the JD: bit according to ETH_Jabber value */
	  /* Set the IFG bit according to ETH_InterFrameGap value */ 
	  /* Set the DCRS bit according to ETH_CarrierSense value */  
	  /* Set the FES bit according to ETH_Speed value */ 
	  /* Set the DO bit according to ETH_ReceiveOwn value */ 
	  /* Set the LM bit according to ETH_LoopbackMode value */ 
	  /* Set the DM bit according to ETH_Mode value */ 
	  /* Set the IPCO bit according to ETH_ChecksumOffload value */                   
	  /* Set the DR bit according to ETH_RetryTransmission value */ 
	  /* Set the ACS bit according to ETH_AutomaticPadCRCStrip value */ 
	  /* Set the BL bit according to ETH_BackOffLimit value */ 
	  /* Set the DC bit according to ETH_DeferralCheck value */                          
	  tmpreg |= (uint32_t)(ETH_InitStruct->ETH_Watchdog | 
					  ETH_InitStruct->ETH_Jabber | 
					  ETH_InitStruct->ETH_InterFrameGap |
					  ETH_InitStruct->ETH_CarrierSense |
					  ETH_InitStruct->ETH_Speed | 
					  ETH_InitStruct->ETH_ReceiveOwn |
					  ETH_InitStruct->ETH_LoopbackMode |
					  ETH_InitStruct->ETH_Mode | 
					  ETH_InitStruct->ETH_ChecksumOffload |    
					  ETH_InitStruct->ETH_RetryTransmission | 
					  ETH_InitStruct->ETH_AutomaticPadCRCStrip | 
					  ETH_InitStruct->ETH_BackOffLimit | 
					  ETH_InitStruct->ETH_DeferralCheck);
	  /* Write to ETHERNET MACCR */
	  ETH->MACCR = (uint32_t)tmpreg;
  
	  /*----------------------- ETHERNET MACFFR Configuration --------------------*/ 
	  /* Set the RA bit according to ETH_ReceiveAll value */
	  /* Set the SAF and SAIF bits according to ETH_SourceAddrFilter value */
	  /* Set the PCF bit according to ETH_PassControlFrames value */
	  /* Set the DBF bit according to ETH_BroadcastFramesReception value */
	  /* Set the DAIF bit according to ETH_DestinationAddrFilter value */
	  /* Set the PR bit according to ETH_PromiscuousMode value */
	  /* Set the PM, HMC and HPF bits according to ETH_MulticastFramesFilter value */
	  /* Set the HUC and HPF bits according to ETH_UnicastFramesFilter value */
	  /* Write to ETHERNET MACFFR */  
	  ETH->MACFFR = (uint32_t)(ETH_InitStruct->ETH_ReceiveAll | 
							  ETH_InitStruct->ETH_SourceAddrFilter |
							  ETH_InitStruct->ETH_PassControlFrames |
							  ETH_InitStruct->ETH_BroadcastFramesReception | 
							  ETH_InitStruct->ETH_DestinationAddrFilter |
							  ETH_InitStruct->ETH_PromiscuousMode |
							  ETH_InitStruct->ETH_MulticastFramesFilter |
							  ETH_InitStruct->ETH_UnicastFramesFilter); 
	  /*--------------- ETHERNET MACHTHR and MACHTLR Configuration ---------------*/
	  /* Write to ETHERNET MACHTHR */
	  ETH->MACHTHR = (uint32_t)ETH_InitStruct->ETH_HashTableHigh;
	  /* Write to ETHERNET MACHTLR */
	  ETH->MACHTLR = (uint32_t)ETH_InitStruct->ETH_HashTableLow;
	  /*----------------------- ETHERNET MACFCR Configuration --------------------*/
	  /* Get the ETHERNET MACFCR value */  
	  tmpreg = ETH->MACFCR;
	  /* Clear xx bits */
	  tmpreg &= MACFCR_CLEAR_MASK;
  
	  /* Set the PT bit according to ETH_PauseTime value */
	  /* Set the DZPQ bit according to ETH_ZeroQuantaPause value */
	  /* Set the PLT bit according to ETH_PauseLowThreshold value */
	  /* Set the UP bit according to ETH_UnicastPauseFrameDetect value */
	  /* Set the RFE bit according to ETH_ReceiveFlowControl value */
	  /* Set the TFE bit according to ETH_TransmitFlowControl value */  
	  tmpreg |= (uint32_t)((ETH_InitStruct->ETH_PauseTime << 16) | 
					   ETH_InitStruct->ETH_ZeroQuantaPause |
					   ETH_InitStruct->ETH_PauseLowThreshold |
					   ETH_InitStruct->ETH_UnicastPauseFrameDetect | 
					   ETH_InitStruct->ETH_ReceiveFlowControl |
					   ETH_InitStruct->ETH_TransmitFlowControl); 
	  /* Write to ETHERNET MACFCR */
	  ETH->MACFCR = (uint32_t)tmpreg;
	  /*----------------------- ETHERNET MACVLANTR Configuration -----------------*/
	  /* Set the ETV bit according to ETH_VLANTagComparison value */
	  /* Set the VL bit according to ETH_VLANTagIdentifier value */  
	  ETH->MACVLANTR = (uint32_t)(ETH_InitStruct->ETH_VLANTagComparison | 
								 ETH_InitStruct->ETH_VLANTagIdentifier); 
       
	  /*-------------------------------- DMA Config ------------------------------*/
	  /*----------------------- ETHERNET DMAOMR Configuration --------------------*/
	  /* Get the ETHERNET DMAOMR value */  
	  tmpreg = ETH->DMAOMR;
	  /* Clear xx bits */
	  tmpreg &= DMAOMR_CLEAR_MASK;
  
